package app

const (
	MainText            = "✨ Добро пожаловать!\n\nРады видеть тебя в нашем сервисе 🤝\nИспользуй меню ниже, чтобы быстро перейти к нужному разделу:\n\n🌍 Страны — доступные направления\n💼 Аккаунты — управление твоими данными\n📚 FAQ — ответы на популярные вопросы\n🛠 Поддержка — помощь и связь с нами\n\n👇 Начни с выбора нужного пункта\n"
	CountryMenuText     = "🌍 Выбор страны\n\nЗдесь ты найдёшь актуальную информацию о требованиях для переезда:\n\n• какие документы нужны\n• условия получения визы\n• требования для работы\n\nВыбери страну, чтобы посмотреть детали 👇\n"
	CountryTripText     = "🌍 Начнём\n\nВыбери направление, которое тебя интересует.\n\nВнутри ты найдёшь всю важную информацию для подготовки и планирования поездки."
	AccountMainMenuText = "👤 Личный кабинет\n\nТвоя персональная зона с сохранённой информацией.\n\nДобавляй нужные варианты в закладки и возвращайся к ним в любое время.\n\n👇 Открой закладки"
	FAQMenuText         = "🥶 Мог бы что-то крутое тут написать, но увы(\n Бот для личного пользования и врятли кому-то когда пригодится"
	HelpText            = "💀 tg @praprae - если возникли проблемы с ботом"
)

const (
	MainMenuCountry = "🌍 Выбрать страну"
	MainMenuAccount = "💼 Личный кабинет"
	MainMenuFAQ     = "📚 FAQ"
	MainMenuHelps   = "🛠 Поддержка"
)

// создание страны константы
const (
	CreateCountry     = "🌍 Создание новой страны\n\nСоздание страны проходит в несколько шагов. Пожалуйста, внимательно заполняйте данные:\n\n1️⃣ Название страны\nВведите полное название страны (например: Vietnam)\n\n2️⃣ Код страны\nВведите короткий код страны (например: VN)\n⚠️ Используйте только английские буквы в верхнем регистре\n\n3️⃣ Описание страны\nВведите краткое описание, которое будет отображаться в списке стран\n\n4️⃣ Подтверждение\nПроверьте введённые данные и подтвердите создание"
	CreateCountryName = "🌍 Шаг 1: Название страны\n\nВведите название страны\nНапример: Вьетнам\n\n💡 Используйте полное официальное или общеупотребимое название"
	CreateCountryCode = "🌍 Шаг 2: Код страны\n\nВведите короткий код страны (например: VN)\n\n⚠️ Используйте только английские буквы в верхнем регистре\n\n📌 Уже заполнено:\nНазвание:"
	CreateCountryDesc = "🌍 Опишите страну в нескольких словах"
)

const (
	AccountBookmarksText = "Добавленные закладки: "
)
