package app

const (
	MainText            = "✨ Добро пожаловать!\n\nРады видеть тебя в нашем сервисе 🤝\nИспользуй меню ниже, чтобы быстро перейти к нужному разделу:\n\n🌍 Страны — доступные направления\n💼 Аккаунты — управление твоими данными\n📚 FAQ — ответы на популярные вопросы\n🛠 Поддержка — помощь и связь с нами\n\n👇 Начни с выбора нужного пункта\n"
	CountryMenuText     = "🌍 Выбор страны\n\nЗдесь ты найдёшь актуальную информацию о требованиях для переезда:\n\n• какие документы нужны\n• условия получения визы\n• требования для работы\n\nВыбери страну, чтобы посмотреть детали 👇\n"
	CountryTripText     = "🌍 Начнём\n\nВыбери направление, которое тебя интересует.\n\nВнутри ты найдёшь всю важную информацию для подготовки и планирования поездки."
	AccountMainMenuText = "👤 Личный кабинет\n\nТвоя персональная зона с сохранённой информацией.\n\nДобавляй нужные варианты в закладки и возвращайся к ним в любое время.\n\n👇 Открой закладки"
)

const (
	MainMenuCountry = "🌍 Выбрать страну"
	MainMenuAccount = "💼 Личный кабинет"
	MainMenuFAQ     = "📚 FAQ"
	MainMenuHelps   = "🛠 Поддержка"
)

const (
	AccountBookmarksText = "Добавленные закладки: "
)
